var languageNum = new Array("en","sc","tc");
var item_name = new Array("D-LINK公司", "无线", "网络摄像机",
"实时视频",
"产品", 
"固件版本",
"第四步：设置时区",
"返回",
"下一步",
"取消",
"当前时间",
"时区",
""
);
var I_DINK_CORPORATION = 0;
var I_WIRELESS = 1;
var I_INTERNET_CAMERA = 2;
var I_LIVE_VIDEO = 3;
var I_PRODUCT = 4;
var I_FWVERSION = 5;
var I_TITLE = 6;
var I_BACK = 7;
var I_NEXT = 8;
var I_CANCEL = 9;
var I_CURRECT_TIME = 10;
var I_TIMEZONE = 11;

var des_item_name = new Array (
"Copyright 2014，D-Link Corporation/D-Link Systems, Inc。版权所有。",
"请配置正确的时间，以确保所有的事件都能在正确的日期和时间触发、抓取和计划，然后点击 <b>下一步</b> 按钮。<br><br>",
""
);

var D_COPYRIGHT = 0;
var D_TITLE_IFNO = 1;

var option_content = new Array (
"(GMT-12:00)日界线西",
"(GMT-10:00)夏威夷",
"(GMT-09:00)阿拉斯加",
"(GMT-08:00)太平洋时间（美国和加拿大）",
"(GMT-08:00)蒂华呐，巴哈，加利福利亚",
"(GMT-07:00)奇瓦瓦，拉巴斯，马扎特兰",
"(GMT-07:00)山地时间（美国和加拿大）",
"(GMT-07:00)亚利桑那",
"(GMT-06:00)中美洲",
"(GMT-06:00)瓜达拉哈拉，墨西哥城，蒙特雷",
"(GMT-06:00)萨斯喀彻温",
"(GMT-06:00)中部时间（美国和加拿大）",
"(GMT-05:00)波哥大，利马，基多",
"(GMT-05:00)东部时间（美国和加拿大）",
"(GMT-05:00)印第安那州（东部）",
"(GMT-04:30)加拉加斯",
"(GMT-04:00)拉巴斯，乔治敦，圣胡安",
"(GMT-04:00)大西洋时间（加拿大）",
"(GMT-04:00)马瑙斯",
"(GMT-04:00)亚松森",
"(GMT-04:00)库亚巴",
"(GMT-03:30)纽芬兰",
"(GMT-03:00)圣地亚哥",
"(GMT-03:00)布宜诺斯艾利斯",
"(GMT-03:00)巴西利亚",
"(GMT-03:00)格陵兰",
"(GMT-03:00)蒙得维的亚",
"(GMT-03:00)卡宴，福塔雷萨",
"(GMT-03:00)萨尔瓦多",
"(GMT-02:00)中大西洋",
"(GMT-01:00)亚速尔群岛",
"(GMT-01:00)佛得角群岛",
"(GMT)卡萨布兰卡",
"(GMT)格林威治标准时间：都柏林，爱丁堡，里斯本，伦敦",
"(GMT)蒙罗维亚，雷克雅维克",
"(GMT+01:00)贝尔格莱德，布拉迪斯拉发，布达佩斯，卢布尔雅那，布拉格",
"(GMT+01:00)中非西部",
"(GMT+01:00)萨拉热窝，斯科普里，华沙，萨格雷布",
"(GMT+01:00)布鲁塞尔，哥本哈根，马德里，巴黎",
"(GMT+01:00)阿姆斯特丹，柏林，伯尔尼，罗马，斯德哥尔摩，维也纳",
"(GMT+01:00)温得和克",
"(GMT+02:00)赫尔辛基，基辅，里加，索菲亚，塔林，维尔纽斯",
"(GMT+02:00)雅典，布加勒斯特，伊斯坦布尔",
"(GMT+02:00)贝鲁特",
"(GMT+02:00)哈拉雷，比勒陀利亚",
"(GMT+02:00)开罗",
"(GMT+02:00)安曼",
"(GMT+02:00)耶路撒冷",
"(GMT+02:00)大马士革",
"(GMT+02:00)尼科西亚",
"(GMT+03:00)明斯克，加里宁格勒",
"(GMT+03:00)巴格达",
"(GMT+03:00)内罗毕",
"(GMT+03:00)威特，利雅得",
"(GMT+03:30)德黑兰",
"(GMT+03:00)莫斯科，圣彼得堡，伏尔加格勒",
"(GMT+04:00)巴库",
"(GMT+04:00)阿布扎比，马斯喀特",
"(GMT+04:00)第比利斯",
"(GMT+04:00)耶烈万",
"(GMT+04:00)路易港",
"(GMT+04:30)喀布尔",
"(GMT+05:00)伊斯兰堡，卡拉奇，塔什干",
"(GMT+05:30)马德拉斯，加尔各答，孟买，新德里",
"(GMT+05:30)科伦坡",
"(GMT+05:45)加德满都",
"(GMT+06:00)阿斯塔纳，达卡",
"(GMT+05:00)叶卡特琳堡",
"(GMT+06:30)仰光",
"(GMT+07:00)曼谷，河内，雅加达",
"(GMT+06:00)新西伯利亚",
"(GMT+08:00)北京，重庆，香港特别行政区，乌鲁木齐",
"(GMT+08:00)台北",
"(GMT+08:00)乌兰巴托",
"(GMT+08:00)珀斯",
"(GMT+08:00)吉隆坡，新加坡",
"(GMT+07:00)克拉斯若亚尔斯克",
"(GMT+09:00)大坂，札幌，东京",
"(GMT+09:00)首尔",
"(GMT+08:00)伊尔库茨克",
"(GMT+09:30)阿德睐德",
"(GMT+09:30)达尔文",
"(GMT+10:00)霍巴特",
"(GMT+10:00)布里斯班",
"(GMT+10:00)堪培拉，墨尔本，悉尼",
"(GMT+10:00)关岛，莫尔兹比港",
"(GMT+09:00)雅库茨克",
"(GMT+11:00)所罗门群岛，新喀里多尼亚",
"(GMT+10:00)符拉迪沃斯托克",
"(GMT+12:00)斐济",
"(GMT+12:00)奥克兰，惠灵顿",
"(GMT+10:00)马加丹",
"(GMT+13:00)努库阿洛法",
"(GMT+13:00)萨摩亚",
""
);

var O_LANG_TIMEZONE_START = 0;

var pop_msg = new Array (
"請求失敗",
""
);

var PMSG_REQUEST_FAILED = 0;

